In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame([[1,2,3], [4,5,6]], index=['a', 'b'], columns=['A','B','C'])
df

   A  B  C
a  1  2  3
b  4  5  6

In [4]:
df = pd.DataFrame([{'a':1,'b':2},{'a':10,'b':20,'c':100}])
df

    a   b      c
0   1   2    NaN
1  10  20  100.0

In [5]:
df = pd.DataFrame({'name':['Reuven','Atara','Shikma','Amotz'],'age':[45,15,13,11],'sex':['m','f','f','m']})
df

     name  age sex
0  Reuven   45   m
1   Atara   15   f
2  Shikma   13   f
3   Amotz   11   m

In [6]:
df = pd.DataFrame({'one':pd.Series([1,2,3]),'ten':pd.Series([10,20,30])})
df

   one  ten
0    1   10
1    2   20
2    3   30

In [9]:
df = pd.DataFrame([{'a':1,'b':2},{'a':10,'b':20,'c':100}])
df
# df.index
# df.columns

RangeIndex(start=0, stop=2, step=1)

In [10]:
df = pd.DataFrame([{'a':1,'b':2},{'a':10,'b':20,'c':100}],index=['one','ten'])
df

      a   b      c
one   1   2    NaN
ten  10  20  100.0

In [13]:
df = pd.DataFrame([[1,2,3],[4,5,6]],index=['a','b'],columns=['x','y','z'])
df

   x  y  z
a  1  2  3
b  4  5  6

In [16]:
df.keys()

Index(['x', 'y', 'z'], dtype='object')

In [15]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [17]:
df.values

array([[1, 2, 3],
       [4, 5, 6]], dtype=int64)

In [21]:
df['x']

a    1
b    4
Name: x, dtype: int64

In [22]:
df['y']

a    2
b    5
Name: y, dtype: int64

In [24]:
df.x

a    1
b    4
Name: x, dtype: int64

In [25]:
df = pd.DataFrame([{'a':1,'b':2},{'a':10,'b':20,'c':100}],index=['one','ten'])
df

      a   b      c
one   1   2    NaN
ten  10  20  100.0

In [26]:
df[['a', 'c']]

      a      c
one   1    NaN
ten  10  100.0

In [32]:
df = pd.DataFrame({'units':[1,2,3],'ten':[10,20,30],'ten':[10,20,30]},index=['one','two','three'])
df

       units  ten
one        1   10
two        2   20
three      3   30

In [33]:
df.loc['one']

units     1
ten      10
Name: one, dtype: int64

In [35]:
df.iloc[0]

units     1
ten      10
Name: one, dtype: int64

In [36]:
df[:1]

     units  ten
one      1   10

In [37]:
df[1:]

       units  ten
two        2   20
three      3   30

In [39]:
df[df.ten > 5]

       units  ten
one        1   10
two        2   20
three      3   30

In [3]:
df = pd.DataFrame({'one':pd.Series([1,2,3]),'ten':pd.Series([10,20,30,40])})
df

   one  ten
0  1.0   10
1  2.0   20
2  3.0   30
3  NaN   40

In [10]:
df['one']=[1,2,3,4]

In [17]:
df = df.replace('a','b')
df

   one  ten
0    1   10
1    2   20
2    3   30
3    4   40

In [19]:
df.replace('a','b',inplace=True)
df

   one  ten
0    1   10
1    2   20
2    3   30
3    4   40

In [22]:
del(df['ten'])
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
df = pd.DataFrame({'one':pd.Series([1,2,3]),'ten':pd.Series([10,20,30,40])})
df

   one  ten
0  1.0   10
1  2.0   20
2  3.0   30
3  NaN   40

In [26]:
df.drop(0)
df

   one  ten
0  1.0   10
1  2.0   20
2  3.0   30
3  NaN   40